In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
df = pd.read_csv("../data/total_production.csv")
df.head()

,Crop year,Unnamed: 1,1990/91,1991/92,1992/93,1993/94,1994/95,1995/96,1996/97,1997/98,...,2010/11,2011/12,2012/13,2013/14,2014/15,2015/16,2016/17,2017/18,2018/19,2019/20
0,April group,NaN,"40,795","42,530","46,868","40,167","39,990","29,396","44,298","39,476",...,"71,811","64,395","75,896","74,494","69,873","71,332","75,508","70,324","81,708","76,076"
1,Angola,(R/A),50,79,78,33,77,62,71,64,...,35,29,33,35,39,41,45,35,42,52
2,Bolivia (Plurinational State of),(A),123,104,120,51,117,142,125,141,...,117,132,105,120,100,84,78,84,83,81
3,Brazil,(A/R),"27,286","27,293","34,603","28,167","28,192","18,060","29,197","26,148",...,"55,428","48,592","55,418","54,689","53,305","52,871","56,788","52,740","65,131","58,211"
4,Burundi,(A/R),487,667,620,393,664,434,401,250,...,353,204,406,163,248,269,196,202,204,272

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59 entries, 0 to 58
Data columns (total 32 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Crop year   59 non-null     object
 1   Unnamed: 1  55 non-null     object
 2   1990/91     59 non-null     object
 3   1991/92     59 non-null     object
 4   1992/93     59 non-null     object
 5   1993/94     59 non-null     object
 6   1994/95     59 non-null     object
 7   1995/96     59 non-null     object
 8   1996/97     59 non-null     object
 9   1997/98     59 non-null     object
 10  1998/99     59 non-null     object
 11  1999/00     59 non-null     object
 12  2000/01     59 non-null     object
 13  2001/02     59 non-null     object
 14  2002/03     59 non-null     object
 15  2003/04     59 non-null     object
 16  2004/05     59 non-null     object
 17  2005/06     59 non-null     object
 18  2006/07     59 non-null     object
 19  2007/08     59 non-null     object
 20  2008/09     59 non-null     object
 21  2009/10     59 non-null     object
 22  2010/11     59 non-null     object
 23  2011/12     59 non-null     object
 24  2012/13     59 non-null     object
 25  2013/14     59 non-null     object
 26  2014/15     59 non-null     object
 27  2015/16     59 non-null     object
 28  2016/17     59 non-null     object
 29  2017/18     59 non-null     object
 30  2018/19     59 non-null     object
 31  2019/20     59 non-null     object
dtypes: object(32)
memory usage: 14.9+ KB

In [5]:
# Omit Unnamed: 1 column
year_columns = df.columns[2:]

# Remove comma from string values and turn into integers
df[year_columns]  =  df[year_columns].apply(lambda x: x.str.replace(",", "")).astype(int)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 59 entries, 0 to 58
Data columns (total 32 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Crop year   59 non-null     object
 1   Unnamed: 1  55 non-null     object
 2   1990/91     59 non-null     int32
 3   1991/92     59 non-null     int32
 4   1992/93     59 non-null     int32
 5   1993/94     59 non-null     int32
 6   1994/95     59 non-null     int32
 7   1995/96     59 non-null     int32
 8   1996/97     59 non-null     int32
 9   1997/98     59 non-null     int32
 10  1998/99     59 non-null     int32
 11  1999/00     59 non-null     int32
 12  2000/01     59 non-null     int32
 13  2001/02     59 non-null     int32
 14  2002/03     59 non-null     int32
 15  2003/04     59 non-null     int32
 16  2004/05     59 non-null     int32
 17  2005/06     59 non-null     int32
 18  2006/07     59 non-null     int32
 19  2007/08     59 non-null     int32
 20  2008/09     59 non-null     int32
 21  2009/10     59 non-null     int32
 22  2010/11     59 non-null     int32
 23  2011/12     59 non-null     int32
 24  2012/13     59 non-null     int32
 25  2013/14     59 non-null     int32
 26  2014/15     59 non-null     int32
 27  2015/16     59 non-null     int32
 28  2016/17     59 non-null     int32
 29  2017/18     59 non-null     int32
 30  2018/19     59 non-null     int32
 31  2019/20     59 non-null     int32
dtypes: int32(30), object(2)
memory usage: 8.0+ KB

In [7]:
# Distinct Countries
countries = df["Crop year"].unique()
print("Distinct countries represented {}".format(countries))

Distinct countries represented ['April group' 'Angola' 'Bolivia (Plurinational State of)' 'Brazil'
 'Burundi' 'Ecuador' 'Indonesia' 'Madagascar' 'Malawi' 'Papua New Guinea'
 'Paraguay' 'Peru' 'Rwanda' 'Timor-Leste' 'Zimbabwe' 'July group' 'Congo'
 'Cuba' 'Dominican Republic' 'Haiti' 'Philippines' 'Tanzania' 'Zambia'
 'October group' 'Cameroon' 'Central African Republic' 'Colombia'
 'Costa Rica' "Cote d'Ivoire" 'Democratic Republic of Congo' 'El Salvador'
 'Equatorial Guinea' 'Ethiopia' 'Gabon' 'Ghana' 'Guatemala' 'Guinea'
 'Guyana' 'Honduras' 'India' 'Jamaica' 'Kenya'
 "Lao People's Democratic Republic" 'Liberia' 'Mexico' 'Nepal' 'Nicaragua'
 'Nigeria' 'Panama' 'Sierra Leone' 'Sri Lanka' 'Thailand' 'Togo'
 'Trinidad & Tobago' 'Uganda' 'Venezuela' 'Viet Nam' 'Yemen' 'Total']

In [8]:
# Distinct Years
years = df.columns.unique()
print("Distinct years {}".format(years[2:]))

Distinct years Index(['1990/91', '1991/92', '1992/93', '1993/94', '1994/95', '1995/96',
       '1996/97', '1997/98', '1998/99', '1999/00', '2000/01', '2001/02',
       '2002/03', '2003/04', '2004/05', '2005/06', '2006/07', '2007/08',
       '2008/09', '2009/10', '2010/11', '2011/12', '2012/13', '2013/14',
       '2014/15', '2015/16', '2016/17', '2017/18', '2018/19', '2019/20'],
      dtype='object')

In [9]:
print("Data frame has null values: {}".format(df.isnull().values.any()))

Data frame has null values: True

In [11]:
# Save dataframe
# df.to_csv("total_production_v1")